prod-deploy/results/prod-02-2-p1-baseline-20260722/round-4/randwrite-true-B-r2/fio.txt
storage_test: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=215931: Wed Jul 22 19:13:54 2026
  write: IOPS=15.2k, BW=3811MiB/s (3996MB/s)(670GiB/180021msec); 0 zone resets
    slat (usec): min=92, max=422776, avg=8186.67, stdev=7691.65
    clat (usec): min=2, max=4772.7k, avg=1050580.76, stdev=252385.43
     lat (usec): min=161, max=4773.9k, avg=1058768.11, stdev=252902.52
    clat percentiles (msec):
     |  1.00th=[  542],  5.00th=[  718], 10.00th=[  810], 20.00th=[  919],
     | 30.00th=[  969], 40.00th=[ 1003], 50.00th=[ 1036], 60.00th=[ 1070],
     | 70.00th=[ 1099], 80.00th=[ 1150], 90.00th=[ 1267], 95.00th=[ 1469],
     | 99.00th=[ 1770], 99.50th=[ 1871], 99.90th=[ 3842], 99.95th=[ 4212],
     | 99.99th=[ 4530]
   bw (  MiB/s): min= 1309, max= 7122, per=100.00%, avg=3876.83, stdev= 6.48, samples=22447
   iops        : min= 4564, max=38390, avg=15530.42, stdev=33.19, samples=44849
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.09%
  lat (msec)   : 100=0.04%, 250=0.10%, 500=0.48%, 750=5.94%, 1000=31.92%
  lat (msec)   : 2000=61.08%, >=2000=0.33%
  cpu          : usr=0.30%, sys=0.29%, ctx=5531490, majf=2, minf=598724
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,2744315,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3811MiB/s (3996MB/s), 3811MiB/s-3811MiB/s (3996MB/s-3996MB/s), io=670GiB (719GB), run=180021-180021msec